[{
  "title": "Around the World in 80 Days",
  "year": "1956",
  "url": "https://www.imdb.com//title/tt0048960/?ref_=fn_ft_tt_1",
  "genreList": [
    "Adventure",
    "Comedy",
    "Family",
    "Romance"
  ],
  "countryList": [
    "USA"
  ],
  "description": "When this movie is made in 1956, one could circumnavigate the globe in a little less than two days. When Jules Verne wrote the story \"Around the World in Eighty Days\" in 1872, he predicted that one day man could accomplish the task in eighty hours, but which most considered folly to do in eighty days in current times, that is except for people like Englishman Phileas Fogg, a regimented man who believed all it would take is exacting work, the skills he possesses. He just has to make sure a train's schedule meets the required sailing schedule which meets the required coach schedule and so on. As such, he takes up what ends up being the highly publicized twenty thousand pounds sterling wager from his fellow members at the London Reform Club to do so, losing the bet which would ruin him financially. Along for the ride is Fogg's new, loyal and devoted valet, the recently arrived Latin immigrant, Passepartout, who possesses unusual skills which could be major assets, but whose all consuming...",
  "budget": "$6,000,000 (estimated)",
  "gross": "$42,000,000",
  "ratingValue": "6.8",
  "ratingCount": "25,175",
  "duration": "2h 47min",
  "castList": [
    "Cantinflas",
    "Finlay Currie",
    "Robert Morley",
    "Ronald Squire",
    "Basil Sydney",
    "Noël Coward",
    "John Gielgud",
    "Trevor Howard",
    "Harcourt Williams",
    "David Niven",
    "Martine Carol",
    "Fernandel",
    "Charles Boyer",
    "Evelyn Keyes",
    "José Greco"
  ],
  "characterList": [
    "Passepartout",
    "Andrew Stuart",
    "Ralph - Bank of England Governor",
    "Reform Club Member",
    "Reform Club Member",
    "Roland Hesketh-Baggott - London Employment Agency Manager (as Noel Coward)",
    "Foster - Fogg's Ex-Valet (as Sir John Gielgud)",
    "Denis Fallentin - Reform Club Member",
    "Hinshaw - Reform Club Aged Steward",
    "Phileas Fogg",
    "Girl in Paris Railroad Station",
    "French Coachman",
    "Monsieur Gasse - Thomas Cook Paris Clerk",
    "Tart - Paris",
    "Flamenco Dancer (as Jose Greco and Troupe)"
  ],
  "directorList": [
    "Michael Anderson",
    "John Farrow"
  ]
}]