[{
  "title": "Harry Potter and the Goblet of Fire",
  "year": "2005",
  "url": "https://www.imdb.com//title/tt0330373/?ref_=fn_ft_tt_1",
  "genreList": [
    "Adventure",
    "Family",
    "Fantasy",
    "Mystery"
  ],
  "countryList": [
    "UK",
    "USA"
  ],
  "description": "Harry's (Daniel Radcliffe's) fourth year at Hogwarts is about to start and he is enjoying the summer vacation with his friends. They get the tickets to The Quidditch World Cup Final, but after the match is over, people dressed like Lord Voldemort's (Ralph Fiennes') \"Death Eaters\" set a fire to all of the visitors' tents, coupled with the appearance of Voldemort's symbol, the \"Dark Mark\" in the sky, which causes a frenzy across the magical community. That same year, Hogwarts is hosting \"The Triwizard Tournament\", a magical tournament between three well-known schools of magic : Hogwarts, Beauxbatons, and Durmstrang. The contestants have to be above the age of seventeen, and are chosen by a magical object called \"The Goblet of Fire\". On the night of selection, however, the Goblet spews out four names instead of the usual three, with Harry unwittingly being selected as the Fourth Champion. Since the magic cannot be reversed, Harry is forced to go with it and brave three exceedingly ...",
  "budget": "$150,000,000 (estimated)",
  "gross": "$896,462,886",
  "ratingValue": "7.7",
  "ratingCount": "557,751",
  "duration": "2h 37min",
  "castList": [
    "Eric Sykes",
    "Timothy Spall",
    "David Tennant",
    "Daniel Radcliffe",
    "Emma Watson",
    "Rupert Grint",
    "Mark Williams",
    "James Phelps",
    "Oliver Phelps",
    "Bonnie Wright",
    "Jeff Rawle",
    "Robert Pattinson",
    "Jason Isaacs",
    "Tom Felton",
    "Stanislav Yanevski"
  ],
  "characterList": [
    "Frank Bryce",
    "Wormtail",
    "Barty Crouch Junior",
    "Harry Potter",
    "Hermione Granger",
    "Ron Weasley",
    "Arthur Weasley",
    "Fred Weasley",
    "George Weasley",
    "Ginny Weasley",
    "Amos Diggory",
    "Cedric Diggory",
    "Lucius Malfoy",
    "Draco Malfoy",
    "Viktor Krum (as Stanislav Ianevski)"
  ],
  "directorList": [
    "Mike Newell"
  ]
}]