[{
  "title": "Teenage Mutant Ninja Turtles: Out of the Shadows",
  "year": "2016",
  "url": "https://www.imdb.com//title/tt3949660/?ref_=fn_ft_tt_1",
  "genreList": [
    "Action",
    "Adventure",
    "Comedy",
    "Sci-Fi"
  ],
  "countryList": [
    "USA",
    "Hong Kong",
    "China",
    "Canada",
    "Denmark",
    "Germany",
    "UK"
  ],
  "description": "The Turtles continue to live in the shadows and no one knows they were the ones who took down Shredder. Vernon is the one everyone thinks is the one who took Shredder down. April O'Neill does some snooping and learns a scientist named Baxter Stockman is working for Shredder. He plans to break him out while he's bringing transported. April tells the turtles, who try to stop it but can't. Stockman tries to teleport Shredder but he some how ends up in another dimension and meets a warlord named Krang who instructs Shredder to assemble a teleportation device he sent to Earth a long time ago. He gives Shredder some mutagen which he uses to transform two criminals who were also in the transport with him, Rock Steady and Bebop, into mutants. They then set out to find the device. April saw the transformation while investigating Stockman. She takes the mutagen and is chased by Shredder's minions, the Foot Clan. She is saved by a man named Casey Jones who was the one transporting Shredder. The ...",
  "budget": "$135,000,000 (estimated)",
  "gross": "$245,623,848",
  "ratingValue": "6.0",
  "ratingCount": "85,609",
  "duration": "1h 52min",
  "castList": [
    "Megan Fox",
    "Will Arnett",
    "Laura Linney",
    "Stephen Amell",
    "Noel Fisher",
    "Jeremy Howard",
    "Pete Ploszek",
    "Alan Ritchson",
    "Tyler Perry",
    "Brian Tee",
    "Stephen Farrelly",
    "Gary Anthony Williams",
    "Peter Donald Badalamenti II",
    "Tony Shalhoub",
    "Brad Garrett"
  ],
  "characterList": [
    "April O'Neil",
    "Vernon Fenwick",
    "Chief Vincent",
    "Casey Jones",
    "Michelangelo",
    "Donatello",
    "Leonardo",
    "Raphael",
    "Baxter Stockman",
    "Shredder",
    "Rocksteady (as Sheamus)",
    "Bebop",
    "Splinter (as Peter D. Badalementi)",
    "Splinter (voice)",
    "Krang (voice)"
  ],
  "directorList": [
    "Dave Green"
  ]
}]