[{
  "title": "What Dreams May Come",
  "year": "1998",
  "url": "https://www.imdb.com//title/tt0120889/?ref_=fn_ft_tt_1",
  "genreList": [
    "Drama",
    "Fantasy",
    "Romance"
  ],
  "countryList": [
    "USA",
    "New Zealand"
  ],
  "description": "During a holidays in Switzerland, a young Chris Nielsen meets by chance Annie Collins in a lake when their boats slightly collide. Sharing a snack when they meet a few hours later, Chris and Annie fall in love each other. Marrying quickly, Chris works as pediatrician and Annie as artist painter and art dealer, and they turn in parents of two children, older Ian and elder Marie. But their happy family life torn apart when being Ian and Marie teenagers, a car accident kills both and the nanny who was driving the van where they were. Four years later, Chris and Annie try to restore their life despite the tragedy and celebrate their anniversary when while he returns to home in his car after to end his daily work, Chris witnesses a car accident in a tunnel during a rainy night. Exiting of the car in an attempt to help people, another car crashes against him, hurting severally. Dying in the hospital, Chris turns in a ghost around his house and his recently widowed Annie, trying tell her ...",
  "budget": "$85,000,000 (estimated)",
  "gross": "$55,382,927",
  "ratingValue": "7.1",
  "ratingCount": "103,343",
  "duration": "1h 53min",
  "castList": [
    "Robin Williams",
    "Cuba Gooding Jr.",
    "Annabella Sciorra",
    "Max von Sydow",
    "Jessica Brooks Grant",
    "Josh Paddock",
    "Rosalind Chao",
    "Lucinda Jenney",
    "Maggie McCarthy",
    "Wilma Bonet",
    "Matt Salinger",
    "Carin Sprague",
    "June Carryl",
    "Paul P. Card IV",
    "Werner Herzog"
  ],
  "characterList": [
    "Chris Nielsen",
    "Albert",
    "Annie Nielsen",
    "The Tracker",
    "Marie Nielsen",
    "Ian Nielsen",
    "Leona",
    "Mrs. Jacobs",
    "Stacey Jacobs",
    "Angie",
    "Reverend Hanley",
    "Best Friend Cindy",
    "Woman in Car Accident (as June Lomena)",
    "Paramedic",
    "Face"
  ],
  "directorList": [
    "Vincent Ward"
  ]
}]